{"_urlRewrite":null,"pageId":"/src/pages/posts/@id","routeParams":{"id":"1bx9doc"},"data":{"post":{"date":1712403231000,"reddit":"https://www.reddit.com/r/touhou/comments/1bx9doc","url":["https://i.redd.it/b2tr9kiyhusc1.png"],"src":"https://www.pixiv.net/en/artworks/116595530","desc":"I bet she goes out on a manhunt every night for Medicine and/or Yamame.\n\nBut man... just imagine all the shenanigans Maomao will do in Gensokyo! Girl will probably make herself Eirin's apprentice, for starters. Eientei's medicine cabinet would probably be locked down and put on guard, so that mad scientist wouldn't be able to perform some truly catastrophic experiments.\n\nAnd assuming the lack of blurring in the language barrier, Maomao will only know Chinese, and at best it'll take her quite a while the figure out Japanese. And on the other hand, I don't think our local Touhou characters knowing kanji characters would translate smoothly to knowing Chinese.\n\nThis also brings up the question about the Lunarians. Since there is Chang'e, I think they speak Chinese up there too – so in this case, Reisen, Eirin, and even Kaguya can probably communicate with Maomao. Meiling might be a good interpreter when she travels around Gensokyo. And then there's Seiga... whose alchemy will be definitely catch her interest. Might even move out to live at Shinreibyou instead, even. That palatial place has more of her element anyway.\n\nA better question would be – aside from Meiling and Seiga – who else would know Chinese? The whole Shinreibyou crew, I think. Yoshika is Seiga's familiar, not to mention being an outright Chinese youkai. And those three probably studied Taoist texts from Seiga's books and scrolls, which would likely be in Chinese. The Myourenji crew might as well, I think – 'cause Buddhist texts were also imported from China. The final candidates based on literature would be Akyuu and Keine. Patchouli's too young for that context – however, her magic does use Chinese elements...\n\nAnd back to Yoshika, I think we will also get a few more people if we base this on whether the youkai origin is Chinese. Yoshika is a jiangshi... Yachie is a jidiao... Yuuma is a taotie... And Son Biten if she does manage to mantle Sun Wukong... Oh yeah, and Junko is Xuan Qi.","artistId":"suwaneko","characterIds":["reisen"],"nsfw":false},"artist":{"id":"suwaneko","name":"すわ猫","linkTwitter":"https://x.com/suwaneko10","linkPixiv":"https://www.pixiv.net/en/users/31855616","portrait":"portraits/artists/suwaneko.webp","artworkCount":19,"characterCount":11},"characters":[{"id":"reisen","name":"Reisen Udongein Inaba","short_name":"Reisen","work":["in"],"portrait":"portraits/characters/reisen.webp","artworkCount":59,"artistCount":33}],"randomArtistPosts":[{"id":"1faee4q","img":"https://i.redd.it/khliw9t6r6nd1.png","nsfw":false},{"id":"1kd33aj","img":"https://i.redd.it/3n32ikh5vdye1.png","nsfw":false},{"id":"1oiyl1v","img":"https://i.redd.it/5678kc5ec0yf1.png","nsfw":false},{"id":"1hlf4vi","img":"https://i.redd.it/49f5xeam8t8e1.png","nsfw":false}],"prevPostId":"1bwh3vr","nextPostId":"1by2hdr"}}