{"pageId":"/src/pages/posts/@id","routeParams":{"id":"1oby1t5"},"data":{"post":{"date":1761004957000,"reddit":"https://www.reddit.com/r/touhou/comments/1oby1t5","url":["https://i.redd.it/8ykdi2vuvcwf1.png"],"src":"https://www.pixiv.net/en/artworks/117796683","desc":"Huh... it seems we don't quite have a consensus on what exactly Hina is wearing.\n\n- On one hand, we have the one-dress camp with the darker top blending as a pattern to the skirt.\n- On the other hand, we have the two-piece camp with the darker top actually separate from the skirt.\n- And on this hand, which I do think is very likely one by her [**portrait,**](https://en.touhouwiki.net/wiki/File:Th10Hina.png) we have an interpretation of a two-piece where the \"edge\" of the covering top part really is ragged.\n\nThere's no way the first one means a literal landmine, so I'm assuming it's a spin on the fact that being around her is literally dangerous – which is kinda like a \"landmine woman\", which seems to be basically a menhera hidden in the ground, a red flag hiding in plain sight.\n\nThough a bandage around her arm instead of the ribbon does make me believe that this Hina might just benefit from therapy.\n\nAnd the youkai pun there stems from 陽 sounding the same as the \"you\" in yōkai. And additional note that I'm guessing at this point that this contrasts with the \"gloomy\" 陰 – basically Hina's a socially awkward introvert.\n\nAnd finally, there's a little nuance with the Ms. Kagiyama. The specific phrase is \"Kagiyama-shi\". The 氏 is very formal. Like if it's in English, a -san would just be a friendly, respectful tone. Using -shi here is equivalent to actually calling another person Miss/Mister like it's a conference or something. The idea is that Hina awkwardly called Nitori \"Ms. Kawashiro\" and Nitori genuinely replied back with \"Ms. Kagiyama\" – and they've been stuck with that ever since.","artistId":"iroiro_yaru_hito","characterIds":["hina","nitori"],"nsfw":false},"artist":{"id":"iroiro_yaru_hito","name":"いろいろやる人","linkTwitter":"https://x.com/iro2do","linkPixiv":"https://www.pixiv.net/en/users/1341860","portrait":"portraits/artists/iroiro_yaru_hito.webp","artworkCount":20,"characterCount":26},"characters":[{"id":"hina","name":"Kagiyama Hina","short_name":"Hina","work":["mof"],"portrait":"portraits/characters/hina.webp","artworkCount":5,"artistCount":5},{"id":"nitori","name":"Kawashiro Nitori","short_name":"Nitori","work":["mof"],"portrait":"portraits/characters/nitori.webp","artworkCount":12,"artistCount":10}],"randomArtistPosts":[{"id":"1ohuly5","img":"https://i.redd.it/5fcuyptdsqxf1.png","nsfw":false},{"id":"1fzqltb","img":"https://i.redd.it/voedficz8qtd1.png","nsfw":false},{"id":"1oz1wtw","img":"https://i.redd.it/cjtluukpop1g1.png","nsfw":false},{"id":"1ot87xm","img":"https://i.redd.it/i2wlcx1a1e0g1.png","nsfw":false}],"prevPostId":"1obg7xf","nextPostId":"1oc728i"}}