{"_urlRewrite":null,"pageId":"/src/pages/posts/@id","routeParams":{"id":"1jo2fk5"},"data":{"post":{"date":1743425472000,"reddit":"https://www.reddit.com/r/touhou/comments/1jo2fk5","url":["https://i.redd.it/q1o94dw0v0se1.png"],"src":"https://x.com/kusatsuku1/status/1896180473279516877","desc":"So this seems to be a well-known lateral thinking riddle in Japan. For those unaware, a lateral thinking riddle is a riddle where the participants are expected to ask questions related to the riddle in order to figure out the answer.\n\nThe riddle goes like this:\n\n> *A man went to a seaside restaurant and ordered \"sea turtle soup.\" After taking a single sip, he confirmed that it was real sea turtle soup. He paid the bill, went home, and killed himself. Why?*\n\nAnd the answer?\n\n> *The man had once been shipwrecked with friends and drifted to an island. There was no food, and the others began eating the flesh of those who had died in order to survive. The man, however, stubbornly refused to eat human flesh. One of his friends, unable to watch him die, lied and told him, \"This is sea turtle soup,\" tricking him into eating human flesh and surviving until they were all rescued. Later at the restaurant, the man tasted real sea turtle soup for the first time and realized the taste was different. With that, he came to realize the horrible truth and, in his despair, took his own life.*","artistId":"kusatsuku","characterIds":["rumia"],"nsfw":false},"artist":{"id":"kusatsuku","name":"くさつく","linkTwitter":"https://x.com/kusatsuku1","portrait":"portraits/placeholders/medic.webp","artworkCount":3,"characterCount":1},"characters":[{"id":"rumia","name":"Rumia","short_name":"Rumia","work":["eosd"],"portrait":"portraits/characters/rumia.webp","artworkCount":30,"artistCount":20}],"randomArtistPosts":[{"id":"1lp5hva","img":"https://i.redd.it/0ehmtomucaaf1.png","nsfw":false},{"id":"1i9nfu8","img":"https://i.redd.it/1vkth0hcb5fe1.png","nsfw":false}],"prevPostId":"1jncrjq","nextPostId":"1jo3plr"}}