{"pageId":"/src/pages/posts/@id","routeParams":{"id":"1nh78v7"},"data":{"post":{"date":1757895246000,"reddit":"https://www.reddit.com/r/touhou/comments/1nh78v7","url":["https://i.redd.it/mv3bsfh218pf1.png","https://i.redd.it/g15mf9t218pf1.png","https://i.redd.it/csjta08318pf1.png"],"src":"https://x.com/b_nosk/status/1949127154702201062","desc":"Huh. The usual name that gets designated for Eirin's practice would be... Yagokoro Pharmacy or something of that note, right? Yeah... somehow, I don't think Eirin would be the type to plaster her name like that. Hōrai is catchy.\n\nEientei was initially just Kaguya and Eirin, right? Then it is quite possible that when Tewi moved in, they did a lot of renovations which would include this room, Reisen's room, and the rabbit doors all over the place. That is to say, Eientei back then might have been much, much more modest.\n\nHuh... so that's the relationship. The \"Daikokusama\" we see the rabbits pretty much worship is specifically Ōkuninushi – the kami who helped Tewi. The conflation came about because \"Daikoku\" is another way to pronounce \"Ōkuni\".\n\n***\n\nWow. Daikokuten is also related to Shinmyōmaru's Miracle Mallet – it's the mallet he holds in his image. There is also a triple deity form combining Daikokuten with Bishamonten and Benzaiten. And of course, since Daikokuten comes from Mahakala... play the conflation game right, then the patron of the Earth Rabbits is no other than **Okina,** as Matarajin is conflated with Mahakala – meaning Nazrin is Okina's servant, Shō is Okina's avatar, and Byakuren is Okina's believer. Last one is extra spicy because Matarajin is a Tendai thing, while Byakuren is Shingon.\n\nSo if we divide Gensōkyō with this assumption, both the Earth Rabbits of Eientei and the monks of Myōrenji will align with Okina.\n\n***\n\nAnd I love that little donation box there. Remember when Tewi was out collecting donations \"for the Hakurei Shrine\"?\n\nA transom is the beam on top of an entryway, and \"fusuma\" is the term for those sliding doors.","artistId":"biinosuke","characterIds":["tewi","reisen","eirin","kaguya","medicine"],"nsfw":false},"artist":{"id":"biinosuke","name":"びいのすけ","linkTwitter":"https://x.com/b_nosk","portrait":"portraits/placeholders/soldier.webp","artworkCount":1,"characterCount":5},"characters":[{"id":"tewi","name":"Inaba Tewi","short_name":"Tewi","work":["in"],"portrait":"portraits/characters/tewi.webp","artworkCount":23,"artistCount":18},{"id":"reisen","name":"Reisen Udongein Inaba","short_name":"Reisen","work":["in"],"portrait":"portraits/characters/reisen.webp","artworkCount":66,"artistCount":37},{"id":"eirin","name":"Yagokoro Eirin","short_name":"Eirin","work":["in"],"portrait":"portraits/characters/eirin.webp","artworkCount":32,"artistCount":18},{"id":"kaguya","name":"Hōraisan Kaguya","short_name":"Kaguya","work":["in"],"portrait":"portraits/characters/kaguya.webp","artworkCount":44,"artistCount":19},{"id":"medicine","name":"Medicine Melancholy","short_name":"Medicine","work":["pofv"],"portrait":"portraits/characters/medicine.webp","artworkCount":12,"artistCount":7}],"randomArtistPosts":[],"prevPostId":"1ngv0u8","nextPostId":"1nhfwhz"}}